import TitleH2 from '@/components/ui/TitleH2';
import './about.sass';

const data = [
  'Привет! Меня зовут Юлия и я начинающий фронтенд-разработчик из Москвы. Так сложилось, что, окончив с отличием ведущий медицинский ВУЗ в России и проработав несколько лет врачом, я волей случая попала на it-курсы от Нетологии, после чего я уже не смогла остановиться и следующие 3 года прошли как в тумане :)',
  'Первый свой диплом я получила по специальности «Python-разработчик» в марте 2023 года. Однако ещё в процессе обучения я поняла, что меня невероятно увлекает именно создание веб-интерфейсов. Поэтому второй мой диплом, полученный в апреле 2025 года был уже по специальности «Frontend-разработчик» и это был самый длинный курс, какой только можно было выбрать. Разумеется, моё обучение не ограничивалось исключительно программой курсов в Нетологии. В марте 2023 года я прошла отборочный интенсив в Школе 21 от Сбера с высоким грейдом и сдала заключительный экзамен на 93 балла из 100. Я окончила множество курсов на stepik, hexlet, freeCodeCamp и др. Количество просмотренных видео на YouTube не поддается исчислению (отдельно хочется отметить Тимофея Хирьянова за его уроки по алгоритмам на python). Параллельно с основным обучением на курсах я постоянно изучала документацию по каждой технологии, которая так или иначе мне попадалась на глаза. До сих пор вспоминаю радость от ощущения, когда впервые смогла самостоятельно настроить под себя Webpack.',
  'С мая 2023 года и по сегодняшний день я являюсь аспирантом-наставником в Нетологии, помогаю студентам с реализацией учебных проектов. В настоящий момент ищу команду, в которой я смогу активно развиваться как профессионал. Готова к реализации самых амбициозных проектов.',
];

const About = () => {
  return (
    <section id="about" className="about">
      <TitleH2 text="Обо мне" />
      <div className="about__content">
        {data.map((text, idx) => (
          <p key={idx} className="about__text">
            {text}
          </p>
        ))}
      </div>
    </section>
  );
};

export default About;
